zhenhong66/My_STM32F2/My_STM32F2x7_ETH_LwIP_V1.0.2/Project/FreeRTOS/udptcp_echo_server_netconn/src/tcpecho.c
/*
 * Copyright (c) 2001-2003 Swedish Institute of Computer Science.
 * All rights reserved. 
 * 
 * Redistribution and use in source and binary forms, with or without modification, 
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 3. The name of the author may not be used to endorse or promote products
 *    derived from this software without specific prior written permission. 
 *
 * THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR IMPLIED 
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF 
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT 
 * SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, 
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT 
 * OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS 
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN 
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING 
 * IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
 * OF SUCH DAMAGE.
 *
 * This file is part of the lwIP TCP/IP stack.
 * 
 * Author: Adam Dunkels <adam@sics.se>
 *
 */


#include "lwip/opt.h"

#if LWIP_NETCONN

#include "lwip/sys.h"
#include "lwip/api.h"
#include "stm32f2xx_it.h"
#include "stm32_eval.h"

#define TCPECHO_THREAD_PRIO  ( tskIDLE_PRIORITY + 3 )
extern uint8_t TxBuffer[0x20]; 
extern __IO uint8_t TxCounter;
extern uint8_t NbrOfDataToTransfer;

struct netconn *conn, *newconn;
/*-----------------------------------------------------------------------------------*/
static void tcpecho_thread(void *arg)
{
  //struct netconn *conn, *newconn;
  err_t err;

  LWIP_UNUSED_ARG(arg);

  /* Create a new connection identifier. */
  conn = netconn_new(NETCONN_TCP);
  
  if (conn!=NULL)
  {  
    /* Bind connection to well known port number 7. */
    err = netconn_bind(conn, NULL, 6);
    
    if (err == ERR_OK)
    {
      /* Tell connection to go into listening mode. */
      netconn_listen(conn);
    
      while (1) 
      {
        /* Grab new connection. */
        newconn = netconn_accept(conn);
    
        /* Process the new connection. */
        if (newconn) 
        {
          struct netbuf *buf;
          void *data;
          u16_t len;
					char *RevPtr;
					u16_t t;
      
          while ((buf = netconn_recv(newconn)) != NULL) 
          {
            do 
            {
              netbuf_data(buf, &data, &len);
							RevPtr=data;
             
							//netconn_write(newconn, data, len, NETCONN_COPY);
						
							for(t=0;t<len;t++)
							{
								TxBuffer[t]=*(RevPtr+t);
							}
							USART_ITConfig(USART3, USART_IT_TXE, ENABLE);
							while(TxCounter < len)
							{}
							USART_ITConfig(USART3, USART_IT_TXE, DISABLE);
							TxCounter=0;
						
          
            } 
            while (netbuf_next(buf) >= 0);
						/*
						for(t=0;t<len;t++)
						{
							TxBuffer[t]=*(RevPtr+t);
						}
						USART_ITConfig(USART3, USART_IT_TXE, ENABLE);
						*/
						/* Wait until EVAL_COM1 send the TxBuffer */
						//while(TxCounter < len)
						//{}
						//USART_ITConfig(USART3, USART_IT_TXE, DISABLE);
						
						/*
						for(t=0;t<len;t++)
							{
							  //printf("len=%d\n",len);
								USART_SendData(EVAL_COM1,USART_RX_BUF[t]);
								printf("\n");
							}
						*/
            netbuf_delete(buf);
          }
					
          /* Close connection and discard connection identifier. */
          netconn_close(newconn);
          netconn_delete(newconn);
        }
      }
    }
    else
    {
      printf(" can not bind TCP netconn");
    }
  }
  else
  {
    printf("can not create TCP netconn");
  }
}
/*-----------------------------------------------------------------------------------*/

void tcpecho_init(void)
{
  sys_thread_new("tcpecho_thread", tcpecho_thread, NULL, DEFAULT_THREAD_STACKSIZE, TCPECHO_THREAD_PRIO);
}
/*-----------------------------------------------------------------------------------*/

#endif /* LWIP_NETCONN */
